In [1]:
%load_ext sql
%sql sqlite:///tiny-college.db

'Connected: @tiny-college.db'

## Part 1: SQL Query (10 points each)

### Question 1 

Write a query to list the first and last names of all freshmen students and their advisors (professors).

In [2]:
%%sql
SELECT Stu_lname, Stu_fname, Prof_lname, Prof_fname 
FROM STUDENT, PROFESSOR
WHERE STU_GRADE = 'Fr' and PROFESSOR.Prof_num = STUDENT.Prof_num;

 * sqlite:///tiny-college.db
Done.

[('Smith', 'John', 'Osaki', 'Ismael')]

### Question 2

Write a query to retrieve, for each class, the department name, course description, and the professor's last name.

In [3]:
%%sql
SELECT CLASS_CODE, Dept_name, Crs_description, Prof_lname
FROM CLASS, COURSE, DEPARTMENT, PROFESSOR
WHERE CLASS.Crs_code = COURSE.Crs_code AND CLASS.Prof_num = PROFESSOR.Prof_num AND COURSE.Dept_code = DEPARTMENT.Dept_code;

 * sqlite:///tiny-college.db
Done.

[(10012, 'Accounting', 'Accounting I', 'Heffington'),
 (10013, 'Accounting', 'Accounting I', 'Heffington'),
 (10014, 'Accounting', 'Accounting I', 'Jones'),
 (10015, 'Accounting', 'Accounting II', 'Osaki'),
 (10016, 'Accounting', 'Accounting II', 'Osaki'),
 (10017, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Coronel'),
 (10018, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Graztevski'),
 (10019, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Coronel'),
 (10020, 'Computer Info. Systems', 'Database Design and Implementation', 'Rob'),
 (10021, 'Computer Info. Systems', 'Intro. to Statistics', 'Graztevski'),
 (10022, 'Computer Info. Systems', 'Intro. to Statistics', 'Graztevski'),
 (10023, 'Computer Info. Systems', 'Statistical Applications', 'Rob'),
 (10024, 'Computer Info. Systems', 'Statistical Applications', 'Rob'),
 (10025, 'Mathematics', 'Mathmatic for Managers', 'Jones')]

### Question 3

Write a query to show all student numbers, student names, their professor names, and department names whose department code is ‘ACCT’ or ‘CIS’.

In [4]:
%%sql
SELECT Stu_num, Stu_lname, Stu_fname, Prof_lname, Prof_fname, Dept_name
FROM STUDENT, PROFESSOR, DEPARTMENT
WHERE (STUDENT.Dept_code = 'ACCT' OR Student.Dept_code = 'CIS') AND STUDENT.Prof_num = PROFESSOR.Prof_num AND DEPARTMENT.Dept_code = STUDENT.Dept_code;

 * sqlite:///tiny-college.db
Done.

[(324257, 'Smithson', 'Anne', 'Coronel', 'Carlos', 'Computer Info. Systems'),
 (324258, 'Brewer', 'Juliette', 'Graztevski', 'Gerald', 'Accounting'),
 (324269, 'Oblonski', 'Walter', 'Smith', 'Melanie', 'Computer Info. Systems'),
 (324274, 'Katinga', 'Raphael', 'Heffington', 'Arnelle', 'Accounting'),
 (324299, 'Smith', 'John', 'Osaki', 'Ismael', 'Accounting')]

### Question 4

Write a query to list the name of departments having equal or over 3 professors.

In [5]:
%%sql
SELECT DEPARTMENT.Dept_code, DEPARTMENT.Dept_name, COUNT(*)
FROM PROFESSOR, DEPARTMENT
WHERE PROFESSOR.Dept_code = DEPARTMENT.Dept_code
GROUP BY DEPARTMENT.Dept_code, DEPARTMENT.Dept_name
HAVING COUNT(*) >= 3;

 * sqlite:///tiny-college.db
Done.

[('ACCT', 'Accounting', 3),
 ('CIS', 'Computer Info. Systems', 3),
 ('ENG', 'English', 3)]

### Question 5

Write a query to list the courses that have prerequisite courses. Show the course code, course_description, course code of the prerequisite course, course description of the prerequisite course.

In [6]:
%%sql
SELECT C.Crs_code, C.Crs_description, PREREQ.Pre_take, PRE.Crs_description
FROM COURSE AS C, COURSE AS PRE, PREREQ
WHERE C.Crs_code = PREREQ.Crs_code AND PRE.Crs_code = PREREQ.Pre_take;

 * sqlite:///tiny-college.db
Done.

[('CIS-420', 'Database Design and Implementation', 'CIS-220', 'Intro. to Microcomputing'),
 ('QM-261', 'Intro. to Statistics', 'MATH-243', 'Mathmatic for Managers'),
 ('QM-362', 'Statistical Applications', 'MATH-243', 'Mathmatic for Managers'),
 ('QM-362', 'Statistical Applications', 'QM-261', 'Intro. to Statistics')]

### Question 6

Write a query to show the names and department name of all professors who has no class.

In [7]:
%%sql
SELECT Prof_lname, Prof_fname, Dept_name
FROM PROFESSOR JOIN DEPARTMENT ON DEPARTMENT.Dept_code = PROFESSOR.Dept_code
WHERE NOT EXISTS
      (SELECt * 
       FROM CLASS
       WHERE CLASS.Prof_num = PROFESSOR.Prof_num);

 * sqlite:///tiny-college.db
Done.

[('Donelly', 'Ronald', 'History'),
 ('Yukon', 'Preston', 'English'),
 ('Washington', 'Ross', 'Marketing/Management'),
 ('Thieu', 'Van', 'Biology'),
 ('Ritula', 'Annelise', 'Mathematics'),
 ('Smith', 'Robert', 'English'),
 ('Dexter', 'Willa', 'Marketing/Management'),
 ('Williams', 'Herman', 'Psychology'),
 ('Smith', 'Melanie', 'Computer Info. Systems'),
 ('Stoddard', 'Doreen', 'Economics/Finance'),
 ('Wilson', 'Todd', 'English'),
 ('Smith', 'Elsa', 'Biology'),
 ('Ardano', 'James', 'History'),
 ('Williamson', 'Kathryn', 'Economics/Finance'),
 ('Herndon', 'Jill', 'Fine Arts')]